Documents/ЛБ_КассовыеЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_КассовыеЛимиты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_КассовыеЛимиты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтделениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделениеСтрокаДляСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардСтрокаДляСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лимиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассчетныйЛимит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийЛимит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонца</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРабочихДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейСнятий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодМеждуДнямиПолученияСредств</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыданныхЗаймов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОтделений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЛомбардов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвиженияДенежныхСредств</Name>
			<Comment>Денежные средства по назначению платежа</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПКО</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРКО</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Comment>Вид денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДвиженияДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацииКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПротоколРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПротоколРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДействияПользователя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РабочиеДниЛомбарда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РабочиеДниЛомбарда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерерывНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерерывОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочиеМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выходной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказРежимРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_КассовыеЛимиты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Организация = Справочники.Организации.НайтиПоКоду("ДМ-000003");
		Объект.Год = Год(ТекущаяДата());
		Объект.ДатаНачала = НачалоКвартала(ТекущаяДата());
		Объект.ДатаКонца = КонецКвартала(ТекущаяДата());
		
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		Иначе
			Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
		КонецЕсли;
		
		УстановитьДатыОтчета(Истина);
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	Если Объект.Проведен Тогда
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ЛимитыЗаполнить.Доступность = Ложь;
	Иначе
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		ЭтаФорма.ТолькоПросмотр = Ложь;
		Элементы.ЛимитыЗаполнить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ВсеОк = ПроверкаЗаполненияПолей();
	
	Если ВсеОк Тогда
		Если СтрНайти(Объект.ОтделениеСтрока, "Екатеринбург") > 0 Тогда
			РассчитатьДляЕкатИЦО();
		Иначе
			РассчитатьДляОстальных();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияПолей()
	
	ВсеОк = Истина;
	
	Если Объект.ДатаНачала = Дата(1,1,1) Тогда
		Сообщить("Не выбрана дата начала период рассчета.");
		ВсеОк = Ложь;
		Возврат ВсеОк;
	КонецЕсли;
	
	//Если ПустаяСтрока(Объект.ОтделениеСтрока) И ПустаяСтрока(Объект.ЛомбардСтрока) Тогда
	//	Сообщить("Не выбрано отделение или ломбард.");
	//	ВсеОк = Ложь;
	//	Возврат ВсеОк;
	//КонецЕсли;
	
	Если Объект.Лимиты.Количество() > 0 Тогда
		
		Ответ = Вопрос("Список лимитов не пуст. При продолжении список будет очищен.
				|Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			ВсеОк = Ложь;
			Возврат ВсеОк;
		Иначе
			Объект.Лимиты.Очистить();
			ВсеОк = Истина;
			Возврат ВсеОк;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВсеОк
КонецФункции

&НаСервере
Процедура РассчитатьДляЕкатИЦО()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		|	СУММА(ЛБ_ДвиженияДенежныхСредств.Сумма) КАК Сумма
		|ПОМЕСТИТЬ СуммаЗаймов
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		|	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		|	И (ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗайма)
		|			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление)
		|			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма))
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		|	КОЛИЧЕСТВО(ЛБ_ДвиженияДенежныхСредств.ВидОперации) КАК КоличествоДнейСнятий
		|ПОМЕСТИТЬ КолСнятий
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		|	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		|	И ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ПротоколРаботы.Ломбард КАК Ломбард,
		|	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ ДниВхода
		|ИЗ
		|	РегистрСведений.ЛБ_ПротоколРаботы КАК ЛБ_ПротоколРаботы
		|ГДЕ
		|	ЛБ_ПротоколРаботы.Ломбард В(&Ломбард)
		|	И ЛБ_ПротоколРаботы.Действие = ЗНАЧЕНИЕ(Перечисление.ЛБ_ДействияПользователя.Вход)
		|	И ЛБ_ПротоколРаботы.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ПротоколРаботы.Ломбард,
		|	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
		|	СУММА(ВЫБОР
		|			КОГДА ЛБ_РабочиеДниЛомбарда.Выходной
		|					ИЛИ ЛБ_РабочиеДниЛомбарда.Период <> ДниВхода.Дата
		|				ТОГДА 0
		|			КОГДА ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		|				ТОГДА 1
		|		КОНЕЦ) КАК КоличествоРабочихДней
		|ПОМЕСТИТЬ КолРабДней
		|ИЗ
		|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДниВхода КАК ДниВхода
		|		ПО ЛБ_РабочиеДниЛомбарда.Ломбард = ДниВхода.Ломбард
		|			И ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		|ГДЕ
		|	ЛБ_РабочиеДниЛомбарда.Ломбард В(&Ломбард)
		|	И ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_РабочиеДниЛомбарда.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ПОМЕСТИТЬ Отделения
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&ДатаКон,
		|			Отделение В
		|				(ВЫБРАТЬ
		|					ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|				ИЗ
		|					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		|ПОМЕСТИТЬ ФактЛимит
		|ИЗ
		|	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		|ГДЕ
		|	ЛБ_КассовыеЛимитыСрезПоследних.Период >= &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СуммаЗаймов.Ломбард КАК Ломбард,
		|	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))) > 7
		|			ТОГДА 7
		|		ИНАЧЕ ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))
		|	КОНЕЦ КАК ПериодМеждуДнямиПолученияСредств,
		|	СуммаЗаймов.Сумма / КолРабДней.КоличествоРабочихДней КАК СуммаЗаймовНаКоличествоРабочихДней
		|ПОМЕСТИТЬ ПромежуточныеРассчеты
		|ИЗ
		|	СуммаЗаймов КАК СуммаЗаймов
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		|		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		|		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отделения.Отделение КАК Отделение,
		|	СуммаЗаймов.Ломбард КАК Ломбард,
		|	СуммаЗаймов.Ломбард.НомерЛомбарда КАК ЛомбардНомерЛомбарда,
		|	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		|	КолРабДней.КоличествоРабочихДней КАК КоличествоРабочихДней,
		|	КолСнятий.КоличествоДнейСнятий КАК КоличествоДнейСнятий,
		|	ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ПериодМеждуДнямиПолученияСредств,
		|	ВЫРАЗИТЬ(ПромежуточныеРассчеты.СуммаЗаймовНаКоличествоРабочихДней * ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ЧИСЛО(15, 2)) КАК РассчетныйЛимит,
		|	ВЫБОР
		|		КОГДА ФактЛимит.ФактическийЛимит ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ФактЛимит.ФактическийЛимит
		|	КОНЕЦ КАК ФактическийЛимит
		|ПОМЕСТИТЬ Рассчеты
		|ИЗ
		|	СуммаЗаймов КАК СуммаЗаймов
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		|		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		|		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ Отделения КАК Отделения
		|		ПО СуммаЗаймов.Ломбард = Отделения.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФактЛимит КАК ФактЛимит
		|		ПО СуммаЗаймов.Ломбард = ФактЛимит.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПромежуточныеРассчеты КАК ПромежуточныеРассчеты
		|		ПО СуммаЗаймов.Ломбард = ПромежуточныеРассчеты.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Рассчеты.РассчетныйЛимит) КАК СуммаРассчетныйЛимит
		|ПОМЕСТИТЬ СуммаРассчитанногоЛимита
		|ИЗ
		|	Рассчеты КАК Рассчеты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		|ПОМЕСТИТЬ ЛимитЦО
		|ИЗ
		|	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рассчеты.Отделение КАК Отделение,
		|	Рассчеты.Ломбард КАК Ломбард,
		|	Рассчеты.ЛомбардНомерЛомбарда КАК НомерЛомбарда,
		|	Рассчеты.СуммаВыданныхЗаймов КАК СуммаВыданныхЗаймов,
		|	Рассчеты.КоличествоРабочихДней КАК КоличествоРабочихДней,
		|	Рассчеты.ПериодМеждуДнямиПолученияСредств КАК ПериодМеждуДнямиПолученияСредств,
		|	НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) КАК ДатаНач,
		|	НАЧАЛОПЕРИОДА(&ДатаКон, ДЕНЬ) КАК ДатаКон,
		|	Рассчеты.РассчетныйЛимит КАК РассчетныйЛимит,
		|	ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2)) КАК ПроцентРасп,
		|	ВЫРАЗИТЬ((ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2))) * ЛимитЦО.ФактическийЛимит / 100 КАК ЧИСЛО(15, 2)) КАК СуммаРасп,
		|	Рассчеты.РассчетныйЛимит - (ВЫРАЗИТЬ((ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2))) * ЛимитЦО.ФактическийЛимит / 100 КАК ЧИСЛО(15, 2))) КАК ЛимитОстатка
		|ИЗ
		|	Рассчеты КАК Рассчеты,
		|	СуммаРассчитанногоЛимита КАК СуммаРассчитанногоЛимита,
		|	ЛимитЦО КАК ЛимитЦО
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рассчеты.Ломбард.НомерЧисловой";
	
	ДатаКон = ?(Объект.ДатаКонца = Дата(1,1,1), ТекущаяДата(), Объект.ДатаКонца);
	
	Запрос.УстановитьПараметр("ДатаНач", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	Если НЕ ПустаяСтрока(Объект.ЛомбардСтрока) Тогда
		Запрос.УстановитьПараметр("Ломбард", Объект.ТаблицаЛомбардов.Выгрузить(, "Ломбард"));
	Иначе
		Запрос.УстановитьПараметр("Ломбард", ПолучитьСписокЛомбардов(ДатаКон, Объект.ТаблицаОтделений.Выгрузить(, "Отделение")));
	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Объект.Лимиты.Загрузить(РезультатЗапроса);
		
		//СтруктураРезультата = ПолучитьСтрокиОтделенийИЛомбардов(РезультатЗапроса);
		//
		//Объект.ОтделениеСтрокаДляСписка = СтруктураРезультата.Отделения;
		//Объект.ЛомбардСтрокаДляСписка = СтруктураРезультата.Ломбарды;
	КонецЕсли;
	
	//Если Объект.ТаблицаЛомбардов.Количество() = 1 И Объект.ТаблицаЛомбардов[0].Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
	//	Объект.ЛомбардСтрокаДляСписка = Справочники.ЛБ_Ломбарды.ЦентральныйОфис.Наименование;
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РассчитатьДляОстальных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		|	СУММА(ЛБ_ДвиженияДенежныхСредств.Сумма) КАК Сумма
		|ПОМЕСТИТЬ СуммаЗаймов
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		|	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		|	И (ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗайма)
		|			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление)
		|			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма))
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		|	КОЛИЧЕСТВО(ЛБ_ДвиженияДенежныхСредств.ВидОперации) КАК КоличествоДнейСнятий
		|ПОМЕСТИТЬ КолСнятий
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		|ГДЕ
		|	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		|	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		|	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		|	И ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ДвиженияДенежныхСредств.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ПротоколРаботы.Ломбард КАК Ломбард,
		|	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ ДниВхода
		|ИЗ
		|	РегистрСведений.ЛБ_ПротоколРаботы КАК ЛБ_ПротоколРаботы
		|ГДЕ
		|	ЛБ_ПротоколРаботы.Ломбард В(&Ломбард)
		|	И ЛБ_ПротоколРаботы.Действие = ЗНАЧЕНИЕ(Перечисление.ЛБ_ДействияПользователя.Вход)
		|	И ЛБ_ПротоколРаботы.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ПротоколРаботы.Ломбард,
		|	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
		|	СУММА(ВЫБОР
		|			КОГДА ЛБ_РабочиеДниЛомбарда.Выходной
		|					ИЛИ ЛБ_РабочиеДниЛомбарда.Период <> ДниВхода.Дата
		|				ТОГДА 0
		|			КОГДА ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		|				ТОГДА 1
		|		КОНЕЦ) КАК КоличествоРабочихДней
		|ПОМЕСТИТЬ КолРабДней
		|ИЗ
		|	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДниВхода КАК ДниВхода
		|		ПО ЛБ_РабочиеДниЛомбарда.Ломбард = ДниВхода.Ломбард
		|			И ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		|ГДЕ
		|	ЛБ_РабочиеДниЛомбарда.Ломбард В(&Ломбард)
		|	И ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_РабочиеДниЛомбарда.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ПОМЕСТИТЬ Отделения
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&ДатаКон,
		|			Отделение В
		|				(ВЫБРАТЬ
		|					ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|				ИЗ
		|					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		|ПОМЕСТИТЬ ФактЛимит
		|ИЗ
		|	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		|ГДЕ
		|	ЛБ_КассовыеЛимитыСрезПоследних.Период >= &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СуммаЗаймов.Ломбард КАК Ломбард,
		|	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))) > 7
		|			ТОГДА 7
		|		ИНАЧЕ ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))
		|	КОНЕЦ КАК ПериодМеждуДнямиПолученияСредств,
		|	СуммаЗаймов.Сумма / КолРабДней.КоличествоРабочихДней КАК СуммаЗаймовНаКоличествоРабочихДней
		|ПОМЕСТИТЬ ПромежуточныеРассчеты
		|ИЗ
		|	СуммаЗаймов КАК СуммаЗаймов
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		|		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		|		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отделения.Отделение КАК Отделение,
		|	СуммаЗаймов.Ломбард КАК Ломбард,
		|	СуммаЗаймов.Ломбард.НомерЛомбарда КАК НомерЛомбарда,
		|	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		|	КолРабДней.КоличествоРабочихДней КАК КоличествоРабочихДней,
		|	КолСнятий.КоличествоДнейСнятий КАК КоличествоДнейСнятий,
		|	ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ПериодМеждуДнямиПолученияСредств,
		|	ВЫРАЗИТЬ(ПромежуточныеРассчеты.СуммаЗаймовНаКоличествоРабочихДней * ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ЧИСЛО(15, 2)) КАК РассчетныйЛимит,
		|	ВЫБОР
		|		КОГДА ФактЛимит.ФактическийЛимит ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ФактЛимит.ФактическийЛимит
		|	КОНЕЦ КАК ФактическийЛимит
		|ИЗ
		|	СуммаЗаймов КАК СуммаЗаймов
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		|		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		|		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ Отделения КАК Отделения
		|		ПО СуммаЗаймов.Ломбард = Отделения.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФактЛимит КАК ФактЛимит
		|		ПО СуммаЗаймов.Ломбард = ФактЛимит.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПромежуточныеРассчеты КАК ПромежуточныеРассчеты
		|		ПО СуммаЗаймов.Ломбард = ПромежуточныеРассчеты.Ломбард
		|
		|УПОРЯДОЧИТЬ ПО
		|	Отделения.Отделение.Наименование,
		|	СуммаЗаймов.Ломбард.НомерЧисловой";
	
	ДатаКон = ?(Объект.ДатаКонца = Дата(1,1,1), ТекущаяДата(), Объект.ДатаКонца);
	
	Запрос.УстановитьПараметр("ДатаНач", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	Если НЕ ПустаяСтрока(Объект.ЛомбардСтрока) Тогда
		Запрос.УстановитьПараметр("Ломбард", Объект.ТаблицаЛомбардов.Выгрузить(, "Ломбард")); //Объект.Ломбард);
	Иначе
		Запрос.УстановитьПараметр("Ломбард", ПолучитьСписокЛомбардов(ДатаКон, ?(Объект.ТаблицаОтделений.Выгрузить(, "Отделение").Количество() > 0, Объект.ТаблицаОтделений.Выгрузить(, "Отделение"), Неопределено))); //Объект.Отделение));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Объект.Лимиты.Загрузить(РезультатЗапроса);
		
		//СтруктураРезультата = ПолучитьСтрокиОтделенийИЛомбардов(РезультатЗапроса);
		//
		//Объект.ОтделениеСтрокаДляСписка = СтруктураРезультата.Отделения;
		//Объект.ЛомбардСтрокаДляСписка = СтруктураРезультата.Ломбарды;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЛомбардов(Дата, Отделение)
	
	Условие = "";
	
	Если Отделение = Неопределено Тогда
		Условие = "НЕ Отделение.Наименование ПОДОБНО ""%Екатеринбург%""
			|				И НЕ Ломбард = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)";
	Иначе
		Условие = "Отделение В (&Отделение)";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,"
		+ Символы.ПС + Условие + Символы.ПС
		+ "				И НЕ Ломбард.Закрыт
		|				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		//|ГДЕ
		//|	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЧисловой";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать(); //Выгрузить();
	
	СписокВозврата = Новый СписокЗначений;
	//МассивВозврата = Новый Массив;
	
	Пока РезультатЗапроса.Следующий() Цикл
		//МассивВозврата.Добавить(Стр.Ломбард);
		СписокВозврата.Добавить(РезультатЗапроса.Ломбард);
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЛимитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтделениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Лимиты.Количество() > 0 Тогда
		
		Ответ = Вопрос("Список лимитов не пуст. При продолжении список будет очищен.
				|Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.Лимиты.Очистить();
			ОткрытьФормуВыбора(Элемент.Имя);
		КонецЕсли;
	Иначе
			ОткрытьФормуВыбора(Элемент.Имя);
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Лимиты.Количество() > 0 Тогда
		
		Ответ = Вопрос("Список лимитов не пуст. При продолжении список будет очищен.
				|Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.Лимиты.Очистить();
			ОткрытьФормуВыбора(Элемент.Имя);
		КонецЕсли;
	Иначе
			ОткрытьФормуВыбора(Элемент.Имя);
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбора(Имя)
	ПараметрыФормы = новый структура;
	ПараметрыФормы.Вставить(Имя, Истина);
	ПараметрыФормы.Вставить("Дата", ?(Объект.ДатаКонца = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Объект.ДатаКонца)));
	ПараметрыФормы.Вставить("Список", ПолучитьМассив(Имя));
	
	ОповещениеПослеВыборка = Новый ОписаниеОповещения("ПослеВыбораЗначений", ЭтаФорма); 
	ОткрытьФорму("Документ.ЛБ_КассовыеЛимиты.Форма.ФормаВыбораЗначений", ПараметрыФормы, Этаформа,,,,ОповещениеПослеВыборка,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассив(Имя)
	Если Имя = "ОтделениеСтрока" Тогда
		ТЗ = Объект.ТаблицаОтделений.Выгрузить();
		Возврат ТЗ.ВыгрузитьКолонку("Отделение");
	Иначе
		ТЗ = Объект.ТаблицаЛомбардов.Выгрузить();
		Возврат ТЗ.ВыгрузитьКолонку("Ломбард");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораЗначений(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора <> Неопределено И РезультатВыбора.Количество() > 0 Тогда

		СсылкаЕкт = ПолучитьСсылкуОтделения("Екатеринбург");
		
		Если ТипЗнч(РезультатВыбора[0]) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			
			Объект.ЛомбардСтрока = "";
			Объект.ТаблицаЛомбардов.Очистить();
			Объект.ТаблицаОтделений.Очистить();
			Текст = "";
			
			Для каждого Стр Из РезультатВыбора Цикл
				Если РезультатВыбора.Количество() > 1 И Стр = СсылкаЕкт Тогда
					Продолжить;
				Иначе
					НоваяСтр = Объект.ТаблицаОтделений.Добавить();
					НоваяСтр.Отделение = Стр;
					
					Текст = ?(Текст <> "", Текст + ", " + Стр, Текст + Стр);
				КонецЕсли;
			КонецЦикла;
		
			Объект.ОтделениеСтрока = Текст;
		Иначе
			Объект.ОтделениеСтрока = "";
			Объект.ТаблицаОтделений.Очистить();
			Объект.ТаблицаЛомбардов.Очистить();
			Текст = "";
			ЭтоЦО = РезультатВыбора.Количество() = 1 И РезультатВыбора[0] = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис");
			
			Если НЕ ЭтоЦО Тогда
				ЕстьЦО = РезультатВыбора.Найти(ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис")) <> Неопределено;
				
				ДатаКон = ?(Объект.ДатаКонца = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Объект.ДатаКонца));
				
				ТолькоЕкт = ПроверитьСписокВыбора(ДатаКон, РезультатВыбора, СсылкаЕкт);
				
				ЛомбардыЕкт = Новый Массив;
				
				Если НЕ ТолькоЕкт Тогда
					ЛомбардыЕкт = ПолучитьСписокЛомбардовЕкт(ДатаКон, СсылкаЕкт);
				КонецЕсли;
				
				Для каждого Стр Из РезультатВыбора Цикл
					Если НЕ ТолькоЕкт ИЛИ ЕстьЦО Тогда
						Если НЕ ТолькоЕкт Тогда
							НайденныеСтроки = ЛомбардыЕкт.Найти(Стр);
						КонецЕсли;
						
						Если НайденныеСтроки <> Неопределено ИЛИ Стр = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
							Продолжить;
						Иначе
							НоваяСтр = Объект.ТаблицаЛомбардов.Добавить();
							НоваяСтр.Ломбард = Стр;
							
							Текст = ?(Текст <> "", Текст + ", " + Стр, Текст + Стр);
						КонецЕсли;
					Иначе
						НоваяСтр = Объект.ТаблицаЛомбардов.Добавить();
						НоваяСтр.Ломбард = Стр;
						
						Текст = ?(Текст <> "", Текст + ", " + Стр, Текст + Стр);
					КонецЕсли;
				КонецЦикла;
				
				Элементы.ЛимитыЗаполнить.Видимость = Истина;
			Иначе
				Для каждого Стр Из РезультатВыбора Цикл
					НоваяСтр = Объект.ТаблицаЛомбардов.Добавить();
					НоваяСтр.Ломбард = Стр;
					
					НоваяСтрЛимиты = Объект.Лимиты.Добавить();
					НоваяСтрЛимиты.Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис");
					
					Текст = ?(Текст <> "", Текст + ", " + Стр, Текст + Стр);
				КонецЦикла;
				
				Элементы.ЛимитыЗаполнить.Видимость = Ложь;
			КонецЕсли;
			
			Объект.ЛомбардСтрока = Текст;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуОтделения(Текст)
	Возврат Справочники.ЛБ_ОтделенияЛомбардов.НайтиПоНаименованию(Текст)
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьСписокВыбора(Дата, ДанныеВыбора, ОтделениеЕкт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,
		|			Ломбард В (&Ломбард)
		|				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", ДанныеВыбора);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество() = 1 И РезультатЗапроса.Найти(ОтделениеЕкт, "Отделение") <> Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокЛомбардовЕкт(Дата, Отделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,
		|			Отделение В (&Отделение)
		|				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЛомбарда";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ломбард");
	
КонецФункции

&НаКлиенте
Процедура ЛимитыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КварталПриИзменении(Элемент)
	УстановитьДатыОтчета();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	УстановитьДатыОтчета();
КонецПроцедуры

&НаСервере
Процедура УстановитьДатыОтчета(ОткрытиеОтчета = Ложь)
	
	Если ОткрытиеОтчета Тогда
		Если Месяц(Объект.ДатаНачала) = 1 Тогда
			Объект.Квартал = 1;
		ИначеЕсли Месяц(Объект.ДатаНачала) = 4 Тогда
			Объект.Квартал = 2;
		ИначеЕсли Месяц(Объект.ДатаНачала) = 7 Тогда
			Объект.Квартал = 3;
		ИначеЕсли Месяц(Объект.ДатаНачала) = 10 Тогда
			Объект.Квартал = 4;
		КонецЕсли;
	Иначе
		Если Объект.Квартал = 1 Тогда
			ДатаКвартала = Дата(Объект.Год, 1, 1);
			Объект.ДатаНачала = НачалоКвартала(ДатаКвартала);
			Объект.ДатаКонца = КонецКвартала(ДатаКвартала);
		ИначеЕсли Объект.Квартал = 2 Тогда
			ДатаКвартала = Дата(Объект.Год, 4, 1);
			Объект.ДатаНачала = НачалоКвартала(ДатаКвартала);
			Объект.ДатаКонца = КонецКвартала(ДатаКвартала);
		ИначеЕсли Объект.Квартал = 3 Тогда
			ДатаКвартала = Дата(Объект.Год, 7, 1);
			Объект.ДатаНачала = НачалоКвартала(ДатаКвартала);
			Объект.ДатаКонца = КонецКвартала(ДатаКвартала);
		ИначеЕсли Объект.Квартал = 4 Тогда
			ДатаКвартала = Дата(Объект.Год, 10, 1);
			Объект.ДатаНачала = НачалоКвартала(ДатаКвартала);
			Объект.ДатаКонца = КонецКвартала(ДатаКвартала);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтделениеОчистка(Элемент, СтандартнаяОбработка)
	Если Объект.Лимиты.Количество() > 0 Тогда
		
		Ответ = Вопрос("Список лимитов не пуст. При продолжении список будет очищен.
				|Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		Иначе
			Объект.Лимиты.Очистить();
			Объект.ЛомбардСтрока = "";
			Объект.ОтделениеСтрока = "";
			Объект.ТаблицаОтделений.Очистить();
			Объект.ТаблицаЛомбардов.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардОчистка(Элемент, СтандартнаяОбработка)
	Если Объект.Лимиты.Количество() > 0 Тогда
		
		Ответ = Вопрос("Список лимитов не пуст. При продолжении список будет очищен.
				|Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		Иначе
			Объект.Лимиты.Очистить();
			Объект.ЛомбардСтрока = "";
			Объект.ОтделениеСтрока = "";
			Объект.ТаблицаОтделений.Очистить();
			Объект.ТаблицаЛомбардов.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьДоступность();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтрокиОтделенийИЛомбардов(Лимиты)
	ОтделенияДляСписка = "";
	ЛомбардыДляСписка = "";
	
	Для каждого Стр Из Лимиты Цикл
		Если ОтделенияДляСписка <> "" И СтрНайти(ОтделенияДляСписка, Стр.Отделение.Наименование) = 0 Тогда
			ОтделенияДляСписка = ОтделенияДляСписка + ", ";
		КонецЕсли;
		Если ЛомбардыДляСписка <> "" Тогда
			ЛомбардыДляСписка = ЛомбардыДляСписка + ", ";
		КонецЕсли;
		
		Если СтрНайти(ОтделенияДляСписка, Стр.Отделение.Наименование) = 0 Тогда
			ОтделенияДляСписка = ОтделенияДляСписка + Стр.Отделение.Наименование
		КонецЕсли;
		
		ЛомбардыДляСписка = ЛомбардыДляСписка + Стр.Ломбард.НаименованиеПолное;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура("Отделения, Ломбарды", ОтделенияДляСписка, ЛомбардыДляСписка);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	Если Объект.ТаблицаЛомбардов.Количество() = 1 И Объект.ТаблицаЛомбардов[0].Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
		Объект.ЛомбардСтрокаДляСписка = Справочники.ЛБ_Ломбарды.ЦентральныйОфис.Наименование;
	Иначе
		СтруктураРезультата = ПолучитьСтрокиОтделенийИЛомбардов(Объект.Лимиты);
		
		Объект.ОтделениеСтрокаДляСписка = СтруктураРезультата.Отделения;
		Объект.ЛомбардСтрокаДляСписка = СтруктураРезультата.Ломбарды;
	КонецЕсли;
КонецПроцедуры
